### DataFrame 행/열 인덱스 변경
- 방법1 : 속성명으로 변경 ==> 전체 변경
- 방법2 : 메서드로 변경 ==> 일부 변경

In [2]:
# 모듈 로팅
import pandas as pd

In [3]:
# 데이터 준비
data={'name':['홍길동', '마징가', '원더우먼'],
       'job':['의적','로봇', '영웅'],
       'gender':['남','남','여'],
       'age':[100, 200, 300],
       'height':[180,300,200]}

In [4]:
# DF으로 데이터 저장
dataDF=pd.DataFrame(data)
print(dataDF)

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [5]:
# column 인덱스를 이름, 직업, 성별. 나이. 키로 변경
dataDF.columns=['이름','직업','성별','나이','키']
dataDF

     이름  직업 성별   나이    키
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [6]:
# 일부변경 : 키 ----> 신장 변경
dataDF.rename(columns={'키':'신장'})

     이름  직업 성별   나이   신장
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [11]:
dataDF.size

15

In [8]:
# inplace 매개변수/파라미터 True 설정 : 원본을 DF을 변경하기 때문에 잘확인할 것!
dataDF.rename(columns={'키':'신장'}, inplace=True)
dataDF

     이름  직업 성별   나이   신장
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [9]:
# 행인덱스 변경 0,1,2 --> p0, p1, p2로 변경
dataDF.index=['p0','p1','p2']
dataDF

      이름  직업 성별   나이   신장
p0   홍길동  의적  남  100  180
p1   마징가  로봇  남  200  300
p2  원더우먼  영웅  여  300  200

In [10]:
# 행인덱스 변경 0,1,2 --> p0, p1, p2만 (END) 로 변경
dataDF.rename(index={'p2':'END'}, inplace=True)
dataDF

       이름  직업 성별   나이   신장
p0    홍길동  의적  남  100  180
p1    마징가  로봇  남  200  300
END  원더우먼  영웅  여  300  200